In [1]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.DataFrame({
    'name': ['이순신', '강감찬', '을지문덕', '김유신'], #호모지니어스적
    #헤테로지니어스적은 나이 , 출신지역 등등을 넣는 법
    'dept': ['연구개발', '영업', '연구개발', '인사']
})

In [5]:
df1

   name  dept
0   이순신  연구개발
1   강감찬    영업
2  을지문덕  연구개발
3   김유신    인사

In [6]:
df2 = pd.DataFrame({
    'emp_name': ['강감찬', '을지문덕', '이순신', '이순신'], #호모지니어스적
    #헤테로지니어스적은 나이 , 출신지역 등등을 넣는 법
    'project': ['S', 'D', 'A', 'S']
})

In [7]:
df2

  emp_name project
0      강감찬       S
1     을지문덕       D
2      이순신       A
3      이순신       S

In [9]:
pd.merge(df1, df2, left_on='name', right_on='emp_name').drop('emp_name', axis=1)

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D

In [10]:
df1, df2

(   name  dept
 0   이순신  연구개발
 1   강감찬    영업
 2  을지문덕  연구개발
 3   김유신    인사,
   emp_name project
 0      강감찬       S
 1     을지문덕       D
 2      이순신       A
 3      이순신       S)

In [11]:
pd.merge(df1, df2, how='outer', left_on='name', right_on='emp_name').drop('emp_name', axis=1)

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D
4   김유신    인사     NaN

In [17]:
import random

names = ['a', 'b', 'c', 'd', 'e']
hit = [random.randint(1,10) for i in range(5)]

In [18]:
hit_rate=pd.DataFrame({
    '선수' : names,
    '안타' : hit
})

In [19]:
hit_rate

  선수  안타
0  a   6
1  b   7
2  c   8
3  d   9
4  e   9

In [22]:
hit_rate['타석']=hit_rate['안타']/random.randint(0,21)

In [23]:
hit_rate

  선수  안타        타석
0  a   6  0.285714
1  b   7  0.333333
2  c   8  0.380952
3  d   9  0.428571
4  e   9  0.428571